In [4]:
pip install pandas

Requirement already satisfied: pandas in c:\users\admin\anaconda3\envs\foundationofai\lib\site-packages (2.1.1)
Requirement already satisfied: numpy>=1.22.4 in c:\users\admin\anaconda3\envs\foundationofai\lib\site-packages (from pandas) (1.25.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\admin\anaconda3\envs\foundationofai\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\anaconda3\envs\foundationofai\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\admin\anaconda3\envs\foundationofai\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\admin\anaconda3\envs\foundationofai\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [62]:
import pandas as pd

In [7]:
pd.__version__

'2.1.1'

In [18]:
a1=pd.Series(['one',2,3,4,5],index=[0,1,2,3,4])

In [19]:
print(a1)

0    one
1      2
2      3
3      4
4      5
dtype: object

In [21]:
season={"rainy":{1:'nov',2:'dec',3:'jan',4:'feb'},"dry":{1:'mar',2:'ab',3:'may',4:'ju'}}

In [23]:
d=pd.DataFrame(season,columns=["rainy","dry"])

In [24]:
d

  rainy  dry
1   nov  mar
2   dec   ab
3   jan  may
4   feb   ju

In [25]:
season={"bike":{1:'xl100',2:'tvs50'},"superbike":{1:'pulsar',2:'NS'}}

In [27]:
d=pd.DataFrame(season,columns=["bike","superbike"])

In [28]:
d

    bike superbike
1  xl100    pulsar
2  tvs50        NS

In [29]:
seaon={"normalmovie":{1:'Fatman',2:'A Cool Fish',3:'A Dark Foe'},"comedymovie":{1:'A Deadly Legend',2:'Up',3:'The Dark Knight'},"tamil movie":{1:'Bama Vijayam',2:'Ponniyin Selvan'


,3:'Vikram'}}

In [33]:
d=pd.DataFrame(seaon,columns=["normalmovie","comedymovie","tamil movie"])

In [34]:
d

   normalmovie      comedymovie      tamil movie
1       Fatman  A Deadly Legend     Bama Vijayam
2  A Cool Fish               Up  Ponniyin Selvan
3   A Dark Foe  The Dark Knight           Vikram

In [63]:
import numpy as np

In [40]:
a=pd.DataFrame(np.random.randint(100,200,size=(15,5)),columns=list('abcdf'))

In [41]:
a

      a    b    c    d    f
0   194  122  188  153  101
1   118  114  101  176  115
2   109  188  102  199  166
3   130  155  126  184  181
4   183  124  152  145  111
5   162  185  157  160  162
6   124  153  115  185  137
7   142  103  191  136  133
8   162  149  141  178  156
9   113  141  180  144  155
10  158  177  178  169  184
11  168  128  197  102  181
12  104  196  145  128  117
13  156  183  156  124  103
14  153  111  155  168  144

In [46]:
a.to_csv('C:/Users/Admin/Music/4th sem  MANIKANDAN/pandas.csv')

In [47]:
d=pd.read_csv('C:/Users/Admin/Music/4th sem  MANIKANDAN/pandas.csv')

In [48]:
d

    Unnamed: 0    a    b    c    d    f
0            0  194  122  188  153  101
1            1  118  114  101  176  115
2            2  109  188  102  199  166
3            3  130  155  126  184  181
4            4  183  124  152  145  111
5            5  162  185  157  160  162
6            6  124  153  115  185  137
7            7  142  103  191  136  133
8            8  162  149  141  178  156
9            9  113  141  180  144  155
10          10  158  177  178  169  184
11          11  168  128  197  102  181
12          12  104  196  145  128  117
13          13  156  183  156  124  103
14          14  153  111  155  168  144

In [64]:
import matplotlib.pyplot as plt
from mpl_toolkits.mplot3d import Axes3D
%matplotlib inline

In [65]:
data={"Game":['GTA ViceCity','Free Fire','BUBG','Train'],"Rating":[7.5,8.2,9.0,3.9],"Download":[152367,789654,357941,582741]}

In [68]:
dataframe=pd.DataFrame(data,columns=["Game","Rating","Download"])

In [69]:
dataframe

           Game  Rating  Download
0  GTA ViceCity     7.5    152367
1     Free Fire     8.2    789654
2          BUBG     9.0    357941
3         Train     3.9    582741

In [75]:
normalization_df=pd.DataFrame({'x':np.random.randint(-100,100,1000),
                              'y':np.random.randint(-80,80,1000),
                              'z':np.random.randint(-150,150,1000)})